In [172]:
import pandas as pd

1. File open

In [173]:
# df=pd.read_csv('train.csv',encoding='latin1')

# df=pd.read_excel('filename.xlsx')

# df=pd.read_json('filename.json')

In [174]:

data1 = {
    "name": ['Ram', 'Shyam', 'Raju'],
    "Age": [12, 34, 22],
    "city": ['newyork', 'paris', 'London']
}

df = pd.DataFrame(data1)
print(df)

# Excel file me save karega
df.to_excel('output.xlsx', index=True)
print(df)

    name  Age     city
0    Ram   12  newyork
1  Shyam   34    paris
2   Raju   22   London
    name  Age     city
0    Ram   12  newyork
1  Shyam   34    paris
2   Raju   22   London

1. condition

In [175]:
data2 = {
    "name": ['Ram', 'Shyam', 'Raju'],
    "Age": [12, 34, 22],
    "city": ['newyork', 'paris', 'London'],
    "salary":[100,200,300],
    "score":[85,90,92]
}

df=pd.DataFrame(data2)
print("sample of dataframe:")
print(df)

sample of dataframe:
    name  Age     city  salary  score
0    Ram   12  newyork     100     85
1  Shyam   34    paris     200     90
2   Raju   22   London     300     92

In [176]:

print("single column return")
print(df['name'])

single column return
0      Ram
1    Shyam
2     Raju
Name: name, dtype: object

In [177]:
print("select multiple column:")
print(df[['salary','Age']])

select multiple column:
   salary  Age
0     100   12
1     200   34
2     300   22

In [178]:
print("employ with salary > 100")
high_salary=df[df['salary']>100]
print(high_salary)

employ with salary > 100
    name  Age    city  salary  score
1  Shyam   34   paris     200     90
2   Raju   22  London     300     92

In [179]:
print("employe with salary and Age")
filter1=df[(df['Age']>12) & (df['salary']>200)]
print(filter1)

employe with salary and Age
   name  Age    city  salary  score
2  Raju   22  London     300     92

In [180]:
filter2=df[(df['Age']>12) | (df['score']>90)]
print(filter2)

    name  Age    city  salary  score
1  Shyam   34   paris     200     90
2   Raju   22  London     300     92

2. DESCRIPTIVE STATISTICS

In [181]:
print(df)

print("\n discriptive statistics:")
print(df.describe())

    name  Age     city  salary  score
0    Ram   12  newyork     100     85
1  Shyam   34    paris     200     90
2   Raju   22   London     300     92

 discriptive statistics:
             Age  salary      score
count   3.000000     3.0   3.000000
mean   22.666667   200.0  89.000000
std    11.015141   100.0   3.605551
min    12.000000   100.0  85.000000
25%    17.000000   150.0  87.500000
50%    22.000000   200.0  90.000000
75%    28.000000   250.0  91.000000
max    34.000000   300.0  92.000000

3. Rows wise

In [182]:
df=pd.read_csv("titanic.csv")
print("display 5 rows of first:")
print(df.head(5))

display 5 rows of first:
  Cabin            Ticket number  Survived
0   NaN         A/5 21171      5         0
1   C85          PC 17599      3         1
2   NaN  STON/O2. 3101282      6         1
3  C123            113803      3         1
4   NaN            373450      A         0

In [183]:
print("display 5 column of last:")
print(df.tail(5))

display 5 column of last:
    Cabin      Ticket number  Survived
886   NaN      211536      3         0
887   B42      112053      3         1
888   NaN  W./C. 6607      1         0
889  C148      111369      2         1
890   NaN      370376      3         0

In [184]:
print("display information of data set")
print(df.info())

display information of data set
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Cabin     204 non-null    object
 1   Ticket    891 non-null    object
 2   number    891 non-null    object
 3   Survived  891 non-null    int64
dtypes: int64(1), object(3)
memory usage: 28.0+ KB
None

4. Topic

In [185]:

print(f"shape:{df.shape}")
print(f"column name:{df.columns}")

shape:(891, 4)
column name:Index(['Cabin', 'Ticket', 'number', 'Survived'], dtype='object')

5. Adding

In [200]:
df=pd.DataFrame(data2)
print("sample of dataframe:")
print(df)

print("add new column:")
df["bonus"]=df["salary"]*0.1
print(df)

print("add ID Employe column:")
df.insert(0,"Employe  ID",[1,2,3])
print(df)

sample of dataframe:
    name  Age     city  salary  score
0    Ram   12  newyork     100     85
1  Shyam   34    paris     200     90
2   Raju   22   London     300     92
add new column:
    name  Age     city  salary  score  bonus
0    Ram   12  newyork     100     85   10.0
1  Shyam   34    paris     200     90   20.0
2   Raju   22   London     300     92   30.0
add ID Employe column:
   Employe  ID   name  Age     city  salary  score  bonus
0            1    Ram   12  newyork     100     85   10.0
1            2  Shyam   34    paris     200     90   20.0
2            3   Raju   22   London     300     92   30.0

6. updating

In [187]:
df.loc[1,'salary']=5500
print(df)

df['salary']=df['salary']*1.05
print(df)

   Employe  ID   name  Age     city  salary  score  bonus
0            1    Ram   12  newyork     100     85   10.0
1            2  Shyam   34    paris    5500     90   20.0
2            3   Raju   22   London     300     92   30.0
   Employe  ID   name  Age     city  salary  score  bonus
0            1    Ram   12  newyork   105.0     85   10.0
1            2  Shyam   34    paris  5775.0     90   20.0
2            3   Raju   22   London   315.0     92   30.0

7. Removing

In [188]:
df=pd.DataFrame(data2)
print("sample of dataframe:")
print(df)

print("\n modify data:")
df.drop(columns=['score','Age'],inplace=True)
print(df)

sample of dataframe:
    name  Age     city  salary  score
0    Ram   12  newyork     100     85
1  Shyam   34    paris     200     90
2   Raju   22   London     300     92

 modify data:
    name     city  salary
0    Ram  newyork     100
1  Shyam    paris     200
2   Raju   London     300

8. missing value

In [189]:
df=pd.read_csv("titanic.csv")
print(df.head(5))


print(df.isnull())

print(df.isnull().sum())

print("remove missing value:")
missing_value=df.dropna(inplace=True)
print(missing_value)

  Cabin            Ticket number  Survived
0   NaN         A/5 21171      5         0
1   C85          PC 17599      3         1
2   NaN  STON/O2. 3101282      6         1
3  C123            113803      3         1
4   NaN            373450      A         0
     Cabin  Ticket  number  Survived
0     True   False   False     False
1    False   False   False     False
2     True   False   False     False
3    False   False   False     False
4     True   False   False     False
..     ...     ...     ...       ...
886   True   False   False     False
887  False   False   False     False
888   True   False   False     False
889  False   False   False     False
890   True   False   False     False

[891 rows x 4 columns]
Cabin       687
Ticket        0
number        0
Survived      0
dtype: int64
remove missing value:
None

In [190]:
data3 = {
    "name": ['Ram', 'Shyam', 'Raju'],
    "Age": [12, None, 22],   # 'NAN' is string here
    "city": ['newyork', 'paris', 'London'],
    "salary": [100, 200, 300],
    "score": [85, 0, 92]
}

df = pd.DataFrame(data3)
print("Sample of dataframe:")
print(df)

df['score']=df['score'].replace(0,df['score'].mean())
print(df)

df['Age'] = df['Age'].fillna(df['Age'].mean())
print(df)

Sample of dataframe:
    name   Age     city  salary  score
0    Ram  12.0  newyork     100     85
1  Shyam   NaN    paris     200      0
2   Raju  22.0   London     300     92
    name   Age     city  salary  score
0    Ram  12.0  newyork     100     85
1  Shyam   NaN    paris     200     59
2   Raju  22.0   London     300     92
    name   Age     city  salary  score
0    Ram  12.0  newyork     100     85
1  Shyam  17.0    paris     200     59
2   Raju  22.0   London     300     92

9. Interpolation

In [191]:
data={
    "Time":[5,3,4,2,1],
    "value":[10,None,30,None,20]
}

print("Before interpolation:")
df=pd.DataFrame(data)
print(df)

df['value']=df['value'].interpolate(method='linear')
print("After interpolation:")
print(df)

Before interpolation:
   Time  value
0     5   10.0
1     3    NaN
2     4   30.0
3     2    NaN
4     1   20.0
After interpolation:
   Time  value
0     5   10.0
1     3   20.0
2     4   30.0
3     2   25.0
4     1   20.0

10. Sorting

In [192]:
print(df)
df.sort_values(by='Time',ascending=True,inplace=True)
print("After sorting")
print(df)

   Time  value
0     5   10.0
1     3   20.0
2     4   30.0
3     2   25.0
4     1   20.0
After sorting
   Time  value
4     1   20.0
3     2   25.0
1     3   20.0
2     4   30.0
0     5   10.0

11. Grouping

In [195]:
data2 = {
    "name": ['Ram', 'Shyam', 'Raju'],
    "Age": [12, 34, 22],
    "city": ['newyork', 'paris', 'London'],
    "salary":[100,200,300],
    "score":[85,90,92]
}

df=pd.DataFrame(data2)
print("sample of dataframe:")
print(df)

grouped=df.groupby(['Age','name'])['salary'].sum()
print(grouped)

sample of dataframe:
    name  Age     city  salary  score
0    Ram   12  newyork     100     85
1  Shyam   34    paris     200     90
2   Raju   22   London     300     92
Age  name
12   Ram      100
22   Raju     300
34   Shyam    200
Name: salary, dtype: int64

12. Merging

In [198]:
df_customer=pd.DataFrame({
    "customer ID":[1,2,3],
    "Name":['rohit','yadav','shyam']

})

df_orders=pd.DataFrame({
    'customer ID':[1,2,3],
    'order amount':[250,300,400]
})

df_merged=pd.merge(df_customer,df_orders,on="customer ID",how='inner')
print('iner join')
print(df_merged)

iner join
   customer ID   Name  order amount
0            1  rohit           250
1            2  yadav           300
2            3  shyam           400